/*
*
* ÎÄ¼þÃû³Æ	£º	PX2EM_Size.cpp
*
*/

//----------------------------------------------------------------------------
inline float EN_Size::GetLength () const
{
	return mLength;
}
//----------------------------------------------------------------------------
inline float EN_Size::GetWidth () const
{
	return mWidth;
}
//----------------------------------------------------------------------------
inline float EN_Size::GetHeight () const
{
	return mHeight;
}
//----------------------------------------------------------------------------
inline float EN_Size::GetRadius () const
{
	return mRadius;
}
//----------------------------------------------------------------------------