/*
*
* ÎÄ¼þÃû³Æ	£º	PX2Mouse.inl
*
*/

//----------------------------------------------------------------------------
// MouseState
//----------------------------------------------------------------------------
inline bool MouseState::IsButtonDown (MouseButtonID button) const
{
	return ((Buttons & (1<<button)) == 0) ? false : true;
}
//----------------------------------------------------------------------------

//----------------------------------------------------------------------------
// Mouse
//----------------------------------------------------------------------------
inline void Mouse::SetEventCallback (MouseListener *listener)
{
	mListener = listener;
}
//----------------------------------------------------------------------------
inline MouseListener *Mouse::GetEventCallback() const
{
	return mListener;
}
//----------------------------------------------------------------------------
inline const MouseState &Mouse::GetMouseState () const
{
	return mState;
}
//----------------------------------------------------------------------------